app/Models/StudentModel.php

SELECT *
FROM `students`
---
    public function getAllStudents(){   //return all student records
        $student = $this->findAll();

SELECT *
FROM `students`
WHERE `id` = '26'
 LIMIT 1
---
    public function getStudentWhere($id){   //return one student where
        $data = $this->where('id', $id)->first();

UPDATE `students` SET `first_name` = 'Butch', `last_name` = 'Cassidy', `address` = 'Somewhere in Blackpool', `email` = 'brendan@uclan.ac.uk', `mobile` = '1234567890'
WHERE `students`.`id` IN ('26')
---
    public function updateStudentWhere($data, $id){ //update student record where
        $this->update($id, $data);